Revit 2024 API
PartUtils.IsValidForCreateParts Method
 Identifies if the given element can be used to create parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static bool IsValidForCreateParts(
	Document document,
	LinkElementId hostOrLinkElementId
)
Visual Basic
Public Shared Function IsValidForCreateParts ( _
	document As Document, _
	hostOrLinkElementId As LinkElementId _
) As Boolean
Visual C++
public:
static bool IsValidForCreateParts(
	Document^ document,
	LinkElementId^ hostOrLinkElementId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
hostOrLinkElementId
Type: Autodesk.Revit.DB.LinkElementId
 Id to be tested for validity for creating part.
Return Value
 True if this id is valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PartUtils Class
Autodesk.Revit.DB Namespace